package 개인과제구상;

public class 이젠드래프트_특성과시너지 {
//	- 시너지 : 조합을 맞출 시 점수 + 5
//	야자조 : 김명호, 한준석, 한요한 있을 시 점수 + 3
//	- 구1조 : 김명호 , 조한준 , 한준석 , 홍성빈  
//	- 구2조 : 김진혁 , 윤선기 , 윤지윤 , 최으뜸 
//	- 구3조 : 김규석 , 박준희 , 신덕용 , 유희진 
//	- 구4조 : 김선제 , 장승빈 , 정준영 , 정희승 
//	- 구5조 : 박민욱 , 박영근 , 채우석 
//	- 구6조 : 김지웅 , 박래찬 , 한요한 
//
//
//
//	- 특성 
//	냉정 : 팀내 냉정 특성을 가진자가 혼자 일시 점수 +2 
//	열정 : 팀내 열정 특성을 가진자가 2명 이상(+1), 3명(+2)
//	소통 : 팀내 소통 특성을 가진자가 한명도 없을 시 팀 점수 -3
//	커피애호가 : 팀내 커피애호가 특성을 가진자가 혼자면 +2 둘부터 -1
//	만능 : 점수+1
//	애연가 : 팀내 애연가 특성 보유자가 혼자이면 점수 -2
//	노력가 : 팀내 독보적 특성을 가진자와 같이 조가 될경우 +3, 없으면 -1
//	부관 : 만능 특성을 가진자와 같이 조가 될경우 +2, 만능 특성을 가진자가 없다면 -1
//	이타적 : 점수 1 + 소통 특성을 가진자 한명당 +1
//	독보적 : 점수 +2
}
