package 과제;

public class 도서대여프로그램
{
	// 도서 대여 프로그램
			// 1. 배열 변수
			// 1-1. 회원[아이디(중복 X), 비밀번호]
			// 1-2. 도서[도서명(중복 X), 도서대여여부]
			// 2. 초기메뉴
			// 2-1. 회원가입 // 2-2. 로그인
			// 2-3. 회원가입시 중복체크
			// 3. 로그인시 메뉴
			// 3-1. 도서검색 // 3-2. 도서목록 // 3. 도서대여 // 4. 도서반납 // 5. 로그아웃
			// + 도서검색시 도서명이 일치하면 도서명과 도서대여여부 출력
			// + 도서 목록시 모든 도서명 출력
			// + 도서대여시 도서대여여부가 가능할때 도서대여 처리
			// + 도서반납시 본인이 대여한 도서만 반납 처리
			// + 로그아웃
			// 로그인시 아이디가 admin이면 관리자메뉴
			// 1. 도서 등록 2. 도서 메뉴 3. 도서삭제(도전) 4. 로그아웃
			// + 도서 등록시 도서명 입력받아 도서 등록처리
			// + 도서 목록시 모든 도서명 출력 // 도서삭제시 삭제할 도서명 입력받아 동일한 도서명 삭제(NULL)
			// 로그아웃시 초기메뉴로
	public static void main(String[] args)
	{
		
	} // me
} // ce
