package Day03;

import java.util.Scanner;

public class Day03_별문제고난이도 { // c  s
	public static void main(String[] args) { // m  s
		Scanner scanner = new Scanner(System.in);
		/*별문제9 : 입력받은 줄만큼 출력

		*********		
		 *******				
		  *****				
		   ***			
		    *		
		    
	별문제10 : 입력받은 줄만큼 출력
	        *
	       ***
	      *****
		 *******
		*********
		 *******
		  *****
		   ***
		    *
	별문제11 : 입력받은 줄만큼 출력 [ 입력받은 행/열 동일 ] 
		*     *		
		 *   *	
		  * *		
		   *		
	      * *		
	     *   *		
	    *     *	*/
	
/*	
									
별문제12 : 입력받은 줄만큼 출력
	*        *
	**      **
	***    ***
	****  ****
	**********
	****  ****
	***    ***
	**      **
	*        *

별문제13 : 입력받은 줄만큼 출력
	                   *                        
                      * *                       
                     *****                      
                    *     *                     
                   * *   * *                    
                  ***** *****                   
                 *           *                  
                * *         * *                 
               *****       *****                
              *     *     *     *               
             * *   * *   * *   * *              
            ***** ***** ***** *****             
           *                       *            
          * *                     * *           
         *****                   *****          
        *     *                 *     *         
       * *   * *               * *   * *        
      ***** *****             ***** *****       
     *           *           *           *      
    * *         * *         * *         * *     
   *****       *****       *****       *****    
  *     *     *     *     *     *     *     *   
 * *   * *   * *   * *   * *   * *   * *   * *  
***** ***** ***** ***** ***** ***** ***** *****	*/
	}// m  e
} // c  e
